{"e": 1, "74": 2, "72": 3, "69": 4, "76": 5, "67": 6, "71": 7, "70": 8, "79": 9, "77": 10, "75": 11, "73": 12, "81": 13, "78": 14, "62": 15, "65": 16, "64": 17, "66": 18, "68": 19, "55": 20, "60": 21, "80": 22, "57": 23, "63": 24, "50": 25, "83": 26, "82": 27, "53": 28, "58": 29, "51": 30, "59": 31, "56": 32, "84": 33, "54": 34, "61": 35, "48": 36, "52": 37, "46": 38, "43": 39, "69and72": 40, "67and71": 41, "45": 42, "47": 43, "44": 44, "64and67": 45, "86": 46, "39": 47, "64and69": 48, "65and70": 49, "38": 50, "62and65": 51, "65and74": 52, "62and67": 53, "67and74": 54, "65and69": 55, "66and69": 56, "41": 57, "67and72": 58, "64and72": 59, "49": 60, "65and72": 61, "69and74": 62, "63and67": 63, "66and74": 64, "67and76": 65, "67and70": 66, "70and74": 67, "69and76": 68, "60and65": 69, "57and62": 70, "55and63": 71, "66and69and74": 72, "85": 73, "36": 74, "53and62": 75, "62and66": 76, "40": 77, "69and71": 78, "58and67": 79, "62and69": 80, "63and72": 81, "67and69": 82, "74and77": 83, "74and79": 84, "56and65": 85, "74and76": 86, "72and76": 87, "43and55": 88, "60and67": 89, "50and65": 90, "61and64": 91, "62and71": 92, "69and77": 93, "62and70": 94, "65and68": 95, "60and72": 96, "55and70": 97, "69and70": 98, "73and76": 99, "62and66and69and74": 100, "61and69": 101, "36and48and60and63and67and72": 102, "72and74": 103, "65and71": 104, "71and74": 105, "60and69": 106, "60and64": 107, "58and74": 108, "58and62": 109, "65and67": 110, "50and62": 111, "53and69": 112, "55and58": 113, "43and50and59": 114, "78and79": 115, "55and64": 116, "67and75": 117, "60and63": 118, "63and66": 119, "71and72": 120, "62and72": 121, "59and67": 122, "72and77": 123, "43and52and60": 124, "51and60": 125, "50and58": 126, "41and65": 127, "62and64": 128, "76and77": 129, "38and45and54and60": 130, "39and46and51": 131, "66and71": 132, "53and74": 133, "51and72": 134, "50and70": 135, "72and75": 136, "66and72": 137, "67and73": 138, "53and68": 139, "51and67": 140, "48and63": 141, "58and63": 142, "77and79": 143, "46and53": 144, "69and78": 145, "64and74": 146, "71and76": 147, "52and67": 148, "56and72": 149, "48and75": 150, "55and74": 151, "68and71": 152, "50and57": 153, "43and59and67": 154, "51and58": 155, "53and57": 156, "68and72": 157, "57and72": 158, "55and73": 159, "58and70": 160, "65and69and74": 161, "38and62": 162, "51and70": 163, "64and67and72": 164, "74and78": 165, "50and54and57and62": 166, "42": 167, "50and53": 168, "69and73": 169, "57and60and65": 170, "64and70": 171, "57and65": 172, "58and65": 173, "53and72": 174, "55and75": 175, "61and67": 176, "56and75": 177, "62and74": 178, "46and62": 179, "59and62and68": 180, "50and60": 181, "67and77": 182, "50and72": 183, "48and67": 184, "51and68": 185, "37and49and56and61and65": 186, "64and76": 187, "46and50": 188, "67and71and76": 189, "67and79": 190, "58and64": 191, "58and68": 192, "60and75": 193, "57and60": 194, "56and76": 195, "61and68and73": 196, "79and81": 197, "38and45and54": 198, "45and52and60": 199, "46and55and63": 200, "64and79": 201, "62and77": 202, "50and77": 203, "48and60": 204, "52and73": 205, "43and70": 206, "50and74": 207, "60and68": 208, "55and67": 209, "56and63and72": 210, "57and61": 211, "52and68": 212, "55and71": 213, "49and57": 214, "58and61": 215, "60and66": 216, "62and65and68and71and74": 217, "43and50and60": 218, "64and69and73": 219, "59and74": 220, "68and76": 221, "55and62": 222, "52and64": 223, "53and60": 224, "65and75": 225, "53and70": 226, "63and70": 227, "55and65": 228, "55and76": 229, "70and72": 230, "53and77": 231, "53and68and72": 232, "51and73": 233, "44and64and73": 234, "62and65and69": 235, "56and73and76": 236, "53and65": 237, "56and71": 238, "59and71": 239, "61and64and69": 240, "39and63and67and70and75": 241, "40and56and59and64": 242, "73and76and81": 243, "36and43and52": 244, "57and67": 245, "57and65and72": 246, "50and65and72": 247, "52and72": 248, "60and62": 249, "55and64and72": 250, "48and76": 251, "36and60and64and67and72": 252, "71and77": 253, "70and77": 254, "55and67and70": 255, "48and70": 256, "56and67": 257, "48and72": 258, "53and75": 259, "49and77": 260, "63and69": 261, "56and68and72": 262, "57and69": 263, "58and63and67": 264, "76and80": 265, "54and75": 266, "53and63": 267, "54and78": 268, "51and63": 269, "58and62and68": 270, "51and63and67": 271, "39and55and58and63": 272, "59and68and75": 273, "52and61": 274, "64and71": 275, "54and73": 276, "75and78": 277, "52and58": 278, "37": 279, "47and50": 280, "44and51": 281, "41and48": 282, "54and63": 283, "64and67and69and73": 284, "64and73": 285, "50and65and74": 286, "55and70and77": 287, "52and60and70": 288, "57and77": 289, "60and67and75": 290, "53and80": 291, "59and69": 292, "53and65and68": 293, "44and72": 294, "50and68": 295, "56and68": 296, "56and72and75": 297, "46and74": 298, "44and63and72": 299, "61and70": 300, "60and80": 301, "49and65": 302, "48and72and75": 303, "49and68": 304, "54and70": 305, "73and74": 306, "64and66": 307, "54and61and69": 308, "47and59and63and66": 309, "38and54and57and62": 310, "55and72": 311, "55and69": 312, "51and58and67": 313, "67and71and74": 314, "50and67": 315, "49and70": 316, "60and63and67and72": 317, "49and73and76": 318, "61and69and78": 319, "52and80": 320, "52and57": 321, "74and75": 322, "38and45and55": 323, "34and51": 324, "76and78": 325, "81and83": 326, "66and71and74": 327, "64and67and73": 328, "60and76": 329, "60and74": 330, "57and74": 331, "41and69and72": 332, "45and72": 333, "64and69and72": 334, "65and77": 335, "52and70": 336, "55and62and70": 337, "58and72": 338, "51and67and72": 339, "45and65": 340, "60and63and70": 341, "70and75": 342, "60and68and72": 343, "49and65and68": 344, "46and73": 345, "58and65and73": 346, "55and70and79": 347, "63and79": 348, "61and68and77": 349, "53and68and73": 350, "41and68": 351, "63and68": 352, "58and77": 353, "51and66": 354, "51and66and70": 355, "56and63and68": 356, "54and63and66": 357, "53and63and68": 358, "56and64": 359, "54and69and74": 360, "57and66and73": 361, "61and65": 362, "57and64and73": 363, "49and64": 364, "59and63": 365, "50and63": 366, "51and70and79": 367, "59and63and80": 368, "56and63and71": 369, "56and64and71": 370, "61and66and75": 371, "71and79": 372, "59and62": 373, "39and58and63and67": 374, "60and66and75": 375, "37and53and56and61": 376, "54and68and72": 377, "56and71and75": 378, "37and61and64and68and73": 379, "43and52and59": 380, "43and51": 381, "55and60": 382, "44and53": 383, "69and79": 384, "55and67and71": 385, "55and65and70": 386, "55and62and72": 387, "52and67and79": 388, "53and69and74": 389, "48and60and64": 390, "47and67": 391, "50and69and77": 392, "57and64and72": 393, "52and60": 394, "48and64and67": 395, "70and76": 396, "76and79": 397, "50and65and69": 398, "52and67and70": 399, "53and62and69": 400, "45and73": 401, "63and65": 402, "53and60and68": 403, "53and56and68": 404, "53and67": 405, "61and70and73": 406, "56and65and72": 407, "51and67and70": 408, "46and68": 409, "61and63": 410, "60and63and75": 411, "58and68and74": 412, "48and67and75": 413, "58and73": 414, "50and70and77": 415, "51and69": 416, "46and64and73": 417, "46and68and73": 418, "46and61and68": 419, "60and68and75": 420, "54and72": 421, "53and68and71": 422, "53and73": 423, "50and69": 424, "57and64": 425, "59and62and74": 426, "59and66and74": 427, "46and67": 428, "53and62and68": 429, "62and65and77and80": 430, "56and71and77": 431, "59and68and71": 432, "51and59": 433, "59and64and73": 434, "65and76": 435, "66and70": 436, "43and67": 437, "59and66and75": 438, "37and73and76": 439, "54and81": 440, "54and69and73": 441, "64and69and74": 442, "62and65and69and74": 443, "57and73": 444, "54and57": 445, "71and74and79": 446, "45and51": 447, "45and52": 448, "46and51": 449, "62and65and70": 450, "62and76": 451, "55and64and70": 452, "55and64and67": 453, "52and67and72": 454, "68and74": 455, "59and65": 456, "53and57and60": 457, "57and67and72": 458, "52and70and79": 459, "48and58and67": 460, "41and65and69": 461, "41and57and62": 462, "60and70": 463, "70and79": 464, "62and69and77": 465, "58and62and77": 466, "43and65and74": 467, "59and65and74": 468, "53and60and69": 469, "54and69": 470, "51and60and67": 471, "60and69and76": 472, "55and77": 473, "50and57and65": 474, "41and69and75": 475, "56and77": 476, "56and59and65": 477, "48and77": 478, "50and70and76": 479, "68and77": 480, "65and80": 481, "56and64and73": 482, "58and75": 483, "61and77": 484, "60and69and75": 485, "58and61and70": 486, "56and73": 487, "51and78": 488, "49and65and73": 489, "48and60and63": 490, "62and68": 491, "48and68": 492, "46and63and66": 493, "61and67and70": 494, "69and71and75": 495, "44and63": 496, "56and72and78": 497, "51and75and78": 498, "51and65": 499, "54and68and70": 500, "56and63": 501, "61and78": 502, "56and64and68": 503, "37and49and54and58": 504, "54and62": 505, "57and66": 506, "52and59and68": 507, "57and62and66": 508, "57and61and64": 509, "55and61": 510, "57and65and74": 511, "45and57": 512, "55and79": 513, "52and55": 514, "46and55": 515, "46and58and62and70": 516, "51and58and63and67": 517, "52and61and67and70": 518, "56and60": 519, "58and61and66": 520, "59and65and68": 521, "56and61and71": 522, "52and61and68": 523, "56and71and76": 524, "56and59and68": 525, "56and59and64": 526, "47and54and71and75": 527, "47and54and63and69": 528, "61and64and73": 529, "59and66and71": 530, "51and71": 531, "64and73and80": 532, "63and71": 533, "50and71": 534, "53and71": 535, "46and65": 536, "44and68": 537, "58and63and67and70": 538, "48and68and78": 539, "51and71and80": 540, "63and71and80": 541, "52and73and80": 542, "49and69and78": 543, "54and74": 544, "46and58": 545, "61and64and70": 546, "62and66and71": 547, "43and52": 548, "48and50": 549, "48and53": 550, "48and51": 551, "51and56": 552, "48and57and63": 553, "50and56": 554, "83and84": 555, "71and73": 556, "68and71and74": 557, "66and76": 558, "55and67and72": 559, "53and62and71": 560, "55and62and71": 561, "53and79": 562, "60and72and76": 563, "55and57": 564, "53and59and62": 565, "52and59and67": 566, "53and59and67": 567, "48and64and72": 568, "50and66and72": 569, "50and67and76": 570, "50and72and77": 571, "55and60and64": 572, "53and60and65": 573, "74and81": 574, "57and72and76": 575, "57and72and77": 576, "58and69": 577, "57and66and74": 578, "53and67and69": 579, "52and67and74": 580, "52and60and72": 581, "53and65and74": 582, "45and55and69": 583, "50and62and65": 584, "58and65and74": 585, "58and62and74": 586, "57and69and72": 587, "59and67and74": 588, "55and71and77": 589, "49and69": 590, "50and58and65": 591, "53and57and62": 592, "46and62and67": 593, "41and70and74": 594, "41and67and70": 595, "58and62and70": 596, "61and65and70": 597, "63and67and70": 598, "58and67and70": 599, "49and56and65": 600, "48and65and68": 601, "48and67and70": 602, "41and72": 603, "48and64and70": 604, "46and65and74": 605, "48and70and76": 606, "70and73": 607, "64and80": 608, "53and65and73": 609, "49and68and70": 610, "51and65and68": 611, "58and67and75": 612, "48and63and67": 613, "58and76": 614, "58and79": 615, "57and72and75": 616, "48and68and77": 617, "41and65and68": 618, "56and65and68": 619, "51and59and62": 620, "62and66and72": 621, "44and72and75": 622, "44and65": 623, "44and60and63": 624, "43and61and70": 625, "56and65and73": 626, "53and69and75": 627, "61and63and67": 628, "61and68and75": 629, "56and65and75": 630, "51and60and63and67": 631, "58and62and67": 632, "48and63and67and72": 633, "51and63and67and72": 634, "46and66and73": 635, "46and66": 636, "51and66and68": 637, "55and70and75": 638, "61and72": 639, "61and80": 640, "54and66and75": 641, "48and66and68": 642, "51and63and66": 643, "42and58and63": 644, "56and62and70": 645, "54and58and75": 646, "49and61and65": 647, "54and58and63": 648, "54and70and78": 649, "51and66and72": 650, "66and67": 651, "56and62": 652, "57and61and64and67": 653, "45and55and61and64": 654, "52and68and73": 655, "50and68and71": 656, "45and52and61and69": 657, "54and59and69and74": 658, "57and68and73": 659, "47and54and62and69": 660, "57and81": 661, "57and61and67": 662, "45and64and66": 663, "57and62and64": 664, "60and81": 665, "62and81": 666, "61and64and71": 667, "57and62and65": 668, "49and67": 669, "48and69": 670, "58and62and65": 671, "57and63": 672, "56and60and63": 673, "58and67and70and75": 674, "56and65and70and74": 675, "53and56": 676, "51and55and70": 677, "55and72and75": 678, "56and63and68and72": 679, "51and56and65and70": 680, "56and60and68and77": 681, "46and58and62and65": 682, "61and68": 683, "51and58and63": 684, "56and61and65": 685, "59and63and68": 686, "47and63and68": 687, "51and68and71": 688, "54and73and78": 689, "58and73and76": 690, "54and70and76": 691, "51and63and66and71": 692, "55and63and73": 693, "55and70and73": 694, "51and58and66and75": 695, "46and53and74and80": 696, "54and63and69": 697, "49and56and64and73": 698, "45and54and61and69": 699, "47and56and64and68": 700, "47and57and64and68": 701, "47and54and59and63": 702, "49and52and69": 703, "47and57and63and66": 704, "47and56and61and65": 705, "47and56and61and66": 706, "49and66and68": 707, "45and56and61and73": 708, "52and56and64and73": 709, "49and56and68and76": 710, "44and51and60and68": 711, "56and59and68and71": 712, "44and59and63and68": 713, "52and64and68": 714, "57and61and73": 715, "47and59and64and68": 716, "55and68": 717, "48and65": 718, "61and71": 719, "44and76": 720, "44and60": 721, "59and68and73": 722, "56and65and71": 723, "58and61and67": 724, "53and61and65": 725, "56and66and72": 726, "44and72and80": 727, "56and69and73": 728, "54and63and73": 729, "47and71and80": 730, "52and76": 731, "66and69and78": 732, "52and68and80": 733, "44and53and58and62": 734, "79and82": 735, "59and62and67": 736, "67and72and76": 737, "39and46and55and63": 738, "39and46": 739, "50and55and57": 740, "44and52and59": 741, "71and73and76": 742, "64and67and71": 743, "53and67and72": 744, "52and62and69": 745, "53and69and72": 746, "53and67and79": 747, "60and69and78": 748, "62and69and78": 749, "55and71and79": 750, "53and70and74": 751, "52and57and60": 752, "48and52and60": 753, "50and53and60": 754, "52and60and69": 755, "41and67and72": 756, "55and65and72": 757, "55and65and71": 758, "59and67and71": 759, "60and67and69": 760, "50and66and74": 761, "47and74": 762, "48and67and76": 763, "52and67and77": 764, "47and67and77": 765, "53and65and72": 766, "55and60and65": 767, "45and64and67": 768, "48and64": 769, "63and75": 770, "60and70and76": 771, "57and66and75": 772, "57and66and72": 773, "57and65and76": 774, "59and64and67": 775, "52and60and67": 776, "45and57and72": 777, "50and57and67": 778, "50and55and67": 779, "50and59and65": 780, "52and62and67": 781, "58and64and74": 782, "65and81": 783, "53and74and77": 784, "56and72and79": 785, "48and65and69": 786, "46and67and74": 787, "45and69and73": 788, "50and52and70": 789, "60and79": 790, "53and62and70": 791, "45and64": 792, "46and62and70": 793, "48and58and63": 794, "46and70": 795, "48and60and68": 796, "52and55and67": 797, "47and55and62": 798, "48and64and68": 799, "48and55and67": 800, "48and56and65": 801, "48and56and77": 802, "48and53and70": 803, "48and52and70": 804, "43and79": 805, "48and53and68": 806, "53and70and73": 807, "57and76": 808, "48and65and70": 809, "48and79": 810, "59and72": 811, "69and84": 812, "58and68and73": 813, "52and67and73": 814, "58and67and72": 815, "52and70and73": 816, "46and65and73": 817, "58and63and79": 818, "56and65and74": 819, "51and75": 820, "60and67and72": 821, "58and67and79": 822, "68and84": 823, "55and72and77": 824, "55and82": 825, "39and66and73": 826, "51and66and73": 827, "45and63and72": 828, "48and63and70": 829, "58and63and70": 830, "52and70and77": 831, "48and70and77": 832, "61and70and76": 833, "65and70and79": 834, "65and72and77": 835, "63and70and79": 836, "63and68and77": 837, "40and67": 838, "48and68and72": 839, "58and65and68": 840, "55and60and63": 841, "43and63": 842, "48and55and63": 843, "38and57and65": 844, "56and60and75": 845, "55and73and76": 846, "62and68and70": 847, "53and59and62and68": 848, "60and63and72": 849, "60and63and67": 850, "66and69and72": 851, "64and68": 852, "61and73": 853, "49and73": 854, "54and70and75": 855, "53and59and68": 856, "54and59and68": 857, "58and66and70": 858, "54and61and66": 859, "48and63and66": 860, "46and61and65": 861, "44and61and65": 862, "51and82": 863, "59and77": 864, "49and61and80": 865, "56and58and73": 866, "54and63and75": 867, "49and58and65": 868, "54and58and65": 869, "53and61and68": 870, "56and60and68": 871, "61and65and73": 872, "48and73": 873, "51and66and75": 874, "54and58": 875, "56and63and73": 876, "56and64and76": 877, "56and61and70": 878, "51and80": 879, "62and77and80": 880, "59and68and77": 881, "37and49and54and61": 882, "59and66": 883, "56and66": 884, "62and67and71": 885, "57and61and66and69": 886, "50and57and62and66": 887, "54and62and66": 888, "45and52and61and67": 889, "44and47and52and62": 890, "43and52and64": 891, "49and52and76": 892, "55and64and71": 893, "49and68and76": 894, "50and59and64and68": 895, "56and59and71and74": 896, "53and59and68and74": 897, "50and81": 898, "52and59and64and79": 899, "55and61and64": 900, "50and71and79": 901, "52and68and74": 902, "45and57and62and64": 903, "59and76": 904, "55and62and67": 905, "58and62and79": 906, "58and67and77": 907, "49and69and76": 908, "49and67and76": 909, "54and71and80": 910, "41and62": 911, "55and72and74": 912, "55and70and74": 913, "52and69and76": 914, "47and65and69": 915, "41and57": 916, "51and60and67and79": 917, "53and56and62and74": 918, "53and60and65and70": 919, "53and58and65and70": 920, "63and68and70": 921, "58and67and70and74": 922, "48and68and75": 923, "55and63and70and73": 924, "50and56and65and70": 925, "51and58and67and75": 926, "60and63and67and75": 927, "55and62and65and70": 928, "46and53and63and65": 929, "59and68": 930, "56and60and65": 931, "56and62and65": 932, "56and64and70": 933, "59and68and78": 934, "51and66and71": 935, "46and61and64": 936, "44and56and63": 937, "49and56and68": 938, "53and61and73": 939, "51and59and68": 940, "47and57and66and75": 941, "49and64and70": 942, "56and63and65": 943, "55and58and70and73": 944, "49and68and71and77": 945, "54and71and78": 946, "56and63and71and80": 947, "49and61and64and70": 948, "61and64and68": 949, "66and68and72": 950, "65and68and73": 951, "46and65and68and74": 952, "56and59and66": 953, "47and56and64": 954, "51and54and59and66": 955, "47and56and63and71": 956, "49and64and73": 957, "52and56and68and71": 958, "51and59and66and71": 959, "44and56and59and71": 960, "44and52and61and68": 961, "47and63and71": 962, "59and66and76": 963, "47and56and59and76": 964, "64and68and80": 965, "52and64and73": 966, "57and63and71": 967, "51and54and71": 968, "72and78": 969, "51and55": 970, "51and79": 971, "63and68and72": 972, "49and58": 973, "48and56": 974, "51and56and63": 975, "49and67and70": 976, "80and81": 977, "59and68and76": 978, "57and61and80": 979, "37and72and75": 980, "51and72and75": 981, "52and71": 982, "54and68and71": 983, "54and66and69": 984, "47and68and71": 985, "56and70": 986, "61and73and82": 987, "56and73and75": 988, "62and68and78": 989, "47and63and66": 990, "62and71and80": 991, "50and73and78": 992, "41and71and73": 993, "54and73and75": 994, "54and80": 995, "61and73and76": 996, "44and69and78": 997, "44and56and63and72": 998, "74and77and80and83": 999, "45and74": 1000, "50and55": 1001, "50and61": 1002, "69and75": 1003, "75and77": 1004, "71and74and80": 1005, "69and73and81": 1006, "76and82": 1007, "88": 1008, "71and76and79": 1009, "43and50": 1010, "38and55": 1011, "45and50": 1012, "43and51and60": 1013, "39and46and55": 1014, "56and58": 1015, "27and34and51": 1016, "41and46": 1017, "41and50": 1018, "49and55and58": 1019, "67and71and76and79": 1020, "67and76and79": 1021, "76and83": 1022, "69and73and76": 1023, "48and67and69": 1024, "52and60and79": 1025, "54and71and83": 1026, "55and74and83": 1027, "57and74and83": 1028, "57and76and84": 1029, "54and74and84": 1030, "62and78": 1031, "62and79": 1032, "57and69and73": 1033, "50and64": 1034, "64and65": 1035, "48and60and65": 1036, "52and59and60": 1037, "50and57and59": 1038, "50and55and59": 1039, "50and53and62": 1040, "50and59and62": 1041, "48and55and64": 1042, "52and55and64": 1043, "50and60and64": 1044, "55and59and62": 1045, "50and62and71": 1046, "48and67and72": 1047, "40and69and72": 1048, "55and60and76": 1049, "55and60and74": 1050, "59and67and72": 1051, "45and67and72": 1052, "48and74": 1053, "50and65and77": 1054, "48and64and76": 1055, "50and64and76": 1056, "50and69and71": 1057, "48and72and77": 1058, "53and70and79": 1059, "53and69and79": 1060, "52and69and79": 1061, "52and65and74": 1062, "55and65and67": 1063, "53and62and72": 1064, "52and55and60": 1065, "53and55and60": 1066, "38and59and62": 1067, "36and60and64": 1068, "52and58and67": 1069, "47and64and67": 1070, "48and62": 1071, "43and62and65": 1072, "53and62and68and71": 1073, "43and55and62and65": 1074, "72and82": 1075, "70and82": 1076, "53and77and81": 1077, "62and72and77": 1078, "62and70and77": 1079, "64and70and79": 1080, "65and69and72": 1081, "58and67and76": 1082, "58and64and79": 1083, "58and60and76": 1084, "52and65and69": 1085, "53and69and76": 1086, "53and69and73": 1087, "50and67and71": 1088, "50and60and67": 1089, "48and60and70": 1090, "55and67and69": 1091, "60and64and72": 1092, "53and76": 1093, "50and52and79": 1094, "46and55and74": 1095, "45and55and73": 1096, "45and52and74": 1097, "45and54and72": 1098, "53and58and70": 1099, "50and60and66": 1100, "50and58and67": 1101, "55and58and70": 1102, "53and65and69": 1103, "55and64and74": 1104, "59and67and77": 1105, "60and67and76": 1106, "57and71and77": 1107, "53and74and79": 1108, "55and69and70": 1109, "50and67and70": 1110, "45and66and67": 1111, "50and53and70": 1112, "48and62and69": 1113, "49and58and67": 1114, "50and55and65": 1115, "50and53and65": 1116, "46and62and65": 1117, "41and65and70": 1118, "38and67and74": 1119, "41and70and75": 1120, "41and70and72": 1121, "41and67and75": 1122, "41and65and74": 1123, "53and60and70": 1124, "60and68and70": 1125, "56and65and70": 1126, "49and53and65": 1127, "47and55and65": 1128, "48and52and67": 1129, "48and56and72": 1130, "48and56and70": 1131, "48and58and72": 1132, "48and55and72": 1133, "48and53and72": 1134, "48and55and82": 1135, "52and82": 1136, "55and80": 1137, "43and71": 1138, "43and47and77": 1139, "58and70and74": 1140, "60and69and74": 1141, "41and63and72": 1142, "46and63and72": 1143, "46and65and72": 1144, "43and65and70": 1145, "50and67and72": 1146, "46and72and74": 1147, "43and70and74": 1148, "43and70and75": 1149, "45and72and75": 1150, "48and72and81": 1151, "46and70and74": 1152, "36and64and67": 1153, "68and80": 1154, "62and75": 1155, "67and84": 1156, "58and64and72": 1157, "53and68and80": 1158, "49and68and72": 1159, "44and67and72": 1160, "44and65and73": 1161, "43and63and73": 1162, "39and70": 1163, "44and73": 1164, "39and67": 1165, "44and70": 1166, "53and68and74": 1167, "53and62and82": 1168, "58and67and74": 1169, "48and68and74": 1170, "55and67and75": 1171, "44and65and75": 1172, "44and67and75": 1173, "48and63and72": 1174, "41and68and77": 1175, "41and62and72": 1176, "53and67and68": 1177, "63and70and73": 1178, "60and68and77": 1179, "52and79": 1180, "48and53and77": 1181, "58and84": 1182, "49and58and73": 1183, "49and61and70": 1184, "51and61and70": 1185, "48and65and73": 1186, "54and63and72": 1187, "48and63and69": 1188, "57and63and72": 1189, "58and63and72": 1190, "53and68and77": 1191, "48and70and79": 1192, "65and68and77": 1193, "61and70and80": 1194, "61and72and80": 1195, "61and70and79": 1196, "60and68and79": 1197, "55and73and75": 1198, "49and58and70": 1199, "57and70": 1200, "67and68": 1201, "55and63and72": 1202, "58and62and72": 1203, "47and65": 1204, "43and62": 1205, "43and74": 1206, "43and74and79": 1207, "39and72and79": 1208, "50and71and77": 1209, "55and71and75": 1210, "55and71and74": 1211, "38and59and65": 1212, "39and59and65": 1213, "41and60and68": 1214, "46and62and68": 1215, "47and62and67": 1216, "44and61and64": 1217, "46and62and66": 1218, "50and57and66": 1219, "43and55and67": 1220, "56and60and72": 1221, "55and60and77": 1222, "62and63and75": 1223, "62and67and75": 1224, "51and60and72": 1225, "51and60and75and79": 1226, "48and60and64and72": 1227, "55and62and67and71": 1228, "47and62and65and67": 1229, "50and53and65and70": 1230, "47and55and62and67": 1231, "41and60and62": 1232, "36and51and60": 1233, "48and55and64and72": 1234, "48and52and67and70": 1235, "60and64and67": 1236, "48and53and63and69": 1237, "49and58and61and65": 1238, "47and56and65and74": 1239, "42and71": 1240, "59and63and66and69and72": 1241, "43and62and65and67and71": 1242, "49and65and71": 1243, "54and61and70": 1244, "44and66": 1245, "37and73": 1246, "48and78": 1247, "45and77": 1248, "46and73and77": 1249, "39and73and79": 1250, "41and72and80": 1251, "37and70and80": 1252, "54and58and70": 1253, "48and66and75": 1254, "49and68and73": 1255, "56and80": 1256, "65and73": 1257, "49and61and73": 1258, "58and65and70": 1259, "45and63and65": 1260, "44and60and65": 1261, "41and58and65": 1262, "42and61and63": 1263, "41and57and65": 1264, "60and82": 1265, "49and61and77": 1266, "49and61and78": 1267, "56and61and75": 1268, "56and60and73": 1269, "51and54and72": 1270, "54and63and70": 1271, "51and61and66": 1272, "51and58and66": 1273, "54and58and66": 1274, "54and56and60": 1275, "56and60and66": 1276, "58and66and73": 1277, "54and66and70": 1278, "54and75and78": 1279, "56and68and73": 1280, "58and80": 1281, "53and66and68": 1282, "54and63and68": 1283, "51and54and70": 1284, "56and61and72": 1285, "56and66and68": 1286, "56and61and76": 1287, "56and61and73": 1288, "56and63and80": 1289, "65and75and78": 1290, "63and75and78": 1291, "58and73and77": 1292, "61and73and77": 1293, "42and68": 1294, "44and53and56and63and66": 1295, "44and49and56and61and65": 1296, "53and56and63": 1297, "44and51and56and61": 1298, "37and49and53and61": 1299, "37and49and53and56": 1300, "37and49and54and63": 1301, "37and48and66": 1302, "37and49and58and66": 1303, "37and49and58and65": 1304, "37and51and60and66": 1305, "37and51and60and68": 1306, "56and59": 1307, "59and66and67": 1308, "50and62and66": 1309, "47and59and68": 1310, "50and59and68": 1311, "47and52and62and69": 1312, "50and66": 1313, "49and50and57and66": 1314, "45and50and61and66": 1315, "43and52and57and61": 1316, "47and50and56and62": 1317, "44and47and52and71": 1318, "42and55and57and64": 1319, "42and52and60and67": 1320, "47and51and59and66": 1321, "47and52and55": 1322, "47and55and62and71": 1323, "47and55and59and64": 1324, "47and52and61and67": 1325, "46and54and61and64": 1326, "47and57and59and66": 1327, "47and52and74": 1328, "45and52and69and73": 1329, "40and54and59and67": 1330, "52and55and62and71": 1331, "38and50and66": 1332, "52and62and79": 1333, "57and61and78": 1334, "55and61and76": 1335, "57and64and79": 1336, "62and66and78": 1337, "52and59and68and74": 1338, "56and61and64and71": 1339, "50and62and66and71": 1340, "49and59and64": 1341, "52and56and61and69": 1342, "45and52and62and69": 1343, "42and64and69": 1344, "46and49and61and78": 1345, "45and51and71": 1346, "53and71and74": 1347, "49and59and64and68": 1348, "52and61and67and71": 1349, "56and62and66and71": 1350, "57and59and66and74": 1351, "53and61and68and73": 1352, "54and57and64and73": 1353, "50and56and59and65": 1354, "49and56and59and65": 1355, "47and56and59and65": 1356, "49and56and61and66": 1357, "49and56and61and65": 1358, "47and50and78": 1359, "50and54and71": 1360, "62and66and73": 1361, "60and66and69": 1362, "59and62and72": 1363, "47and57and66and71": 1364, "45and55and64and72": 1365, "45and52and67and72": 1366, "47and59and67and71": 1367, "54and55and62and71": 1368, "54and57and60and69": 1369, "52and64and67": 1370, "54and62and71": 1371, "52and59and67and73": 1372, "45and55and61and76": 1373, "48and54and64and69": 1374, "43and54and62and71": 1375, "44and50and59and71": 1376, "45and50and62": 1377, "46and52and61and66": 1378, "46and54and73": 1379, "47and64": 1380, "49and64and67": 1381, "45and73and79": 1382, "40and73and79": 1383, "62and76and79": 1384, "52and55and78and81": 1385, "59and76and79": 1386, "52and55and73and76": 1387, "52and55and64and76": 1388, "54and57and66and74": 1389, "47and50and62and71": 1390, "50and54and62and71": 1391, "49and52and64and71": 1392, "45and61and69": 1393, "45and81": 1394, "47and74and78": 1395, "55and57and69and73": 1396, "52and54and67and72": 1397, "50and57and64and72": 1398, "50and55and66and71": 1399, "49and52and62and71": 1400, "50and54and69": 1401, "45and54and60and69": 1402, "43and47and59and69": 1403, "45and49and64and67": 1404, "60and64and69": 1405, "57and71": 1406, "52and70and74": 1407, "60and64and81": 1408, "55and74and77": 1409, "57and69and77": 1410, "45and64and73": 1411, "58and62and64": 1412, "55and58and62": 1413, "52and57and64": 1414, "50and53and69": 1415, "43and52and70": 1416, "41and69": 1417, "40and80": 1418, "53and62and81": 1419, "47and73and76": 1420, "57and79": 1421, "49and69and79": 1422, "55and58and74": 1423, "53and55and71": 1424, "45and61and67": 1425, "55and62and64": 1426, "48and57": 1427, "45and53": 1428, "40and53and69": 1429, "45and69and72": 1430, "45and61and62": 1431, "43and58": 1432, "51and55and63": 1433, "58and60and70": 1434, "50and58and70": 1435, "46and56and62and70": 1436, "46and55and63and70": 1437, "46and53and63and70": 1438, "46and55and60and75": 1439, "46and55and67and75": 1440, "45and53and72": 1441, "45and53and72and75": 1442, "46and53and72and74": 1443, "43and55and70and77": 1444, "48and55and70and75": 1445, "53and60and69and72": 1446, "53and60and69and77": 1447, "53and60and69and75": 1448, "58and62and70and74": 1449, "57and60and65and77": 1450, "55and62and67and70": 1451, "51and60and65and69": 1452, "51and61and67and70": 1453, "53and60and65and69": 1454, "53and60and63and69": 1455, "46and58and65and74": 1456, "58and68and77": 1457, "51and63and67and75": 1458, "58and62and65and77": 1459, "67and68and72": 1460, "55and58and63and75": 1461, "58and70and74and82": 1462, "63and67and75and79": 1463, "67and75and84": 1464, "64and67and79and82": 1465, "65and67and72and80": 1466, "53and65and77and80": 1467, "57and65and75and84": 1468, "58and65and74and77": 1469, "65and74and82": 1470, "63and65and70and79": 1471, "60and72and75": 1472, "55and67and77": 1473, "48and70and72": 1474, "48and67and77": 1475, "41and65and75": 1476, "51and68and77": 1477, "46and68and74": 1478, "46and68and70": 1479, "46and67and75": 1480, "50and68and70": 1481, "53and60and67and68": 1482, "46and61and70": 1483, "41and61and70": 1484, "51and60and68": 1485, "51and55and63and75": 1486, "51and60and67and75": 1487, "58and62and65and74": 1488, "62and70and79": 1489, "56and65and74and77": 1490, "53and65and68and74": 1491, "56and62and70and77": 1492, "55and63and70": 1493, "58and65and68and73": 1494, "51and63and67and73": 1495, "48and60and63and70": 1496, "53and60and63and68": 1497, "53and56and62and68": 1498, "46and53and62and68": 1499, "46and53and58and68": 1500, "45and63and66": 1501, "45and60and63and66": 1502, "46and51and63and65": 1503, "46and53and62and65": 1504, "58and66": 1505, "51and53and68": 1506, "51and56and71": 1507, "53and56and65": 1508, "51and59and66": 1509, "53and56and62and70": 1510, "53and57and65and72": 1511, "54and57and63and72": 1512, "61and68and76": 1513, "55and61and70and75": 1514, "51and55and70and73": 1515, "59and63and70": 1516, "58and63and78": 1517, "54and58and73": 1518, "47and66and68": 1519, "44and58and63": 1520, "49and51and66": 1521, "47and64and68": 1522, "49and59and68": 1523, "54and58and68": 1524, "54and56and71": 1525, "53and61and71": 1526, "49and61and68": 1527, "51and58and68": 1528, "44and61and70": 1529, "44and64and68": 1530, "47and63and73": 1531, "46and58and66and74": 1532, "48and58and66and75": 1533, "51and59and68and77": 1534, "53and59and80": 1535, "53and61and77and80": 1536, "54and61and82": 1537, "54and59and68and75": 1538, "51and64and68": 1539, "47and63and70": 1540, "47and67and73": 1541, "51and68and70": 1542, "51and67and75": 1543, "51and67and73": 1544, "56and61and64": 1545, "56and59and71": 1546, "54and64and69and73": 1547, "54and63and68and72": 1548, "54and61and69and75": 1549, "57and61and64and75": 1550, "57and61and69and78": 1551, "58and63and73": 1552, "60and69and75and78": 1553, "61and69and73and78": 1554, "63and71and75": 1555, "59and71and75": 1556, "47and75and82": 1557, "58and61and70and80": 1558, "57and64and73and80": 1559, "57and64and73and79": 1560, "51and66and70and77": 1561, "41and60and63and69": 1562, "51and59and70": 1563, "59and63and73": 1564, "56and68and76": 1565, "63and66and70": 1566, "66and70and80": 1567, "66and75and78": 1568, "65and75and81": 1569, "63and70and75": 1570, "51and60and69and78": 1571, "53and65and74and83": 1572, "54and63and66and70": 1573, "54and58and63and75": 1574, "56and59and65and68": 1575, "58and63and66": 1576, "51and56and71and77": 1577, "50and56and71and77": 1578, "46and54and66and75": 1579, "52and59": 1580, "49and59": 1581, "47and59": 1582, "54and61": 1583, "59and61": 1584, "57and59and64": 1585, "56and57and66": 1586, "57and64and66": 1587, "54and64and71": 1588, "51and54and59and71": 1589, "49and56and66and73": 1590, "49and52and68and76": 1591, "49and52and70and76": 1592, "42and54and71and73": 1593, "42and54and69and73": 1594, "44and54and69and71": 1595, "44and52and68and71": 1596, "40and52and68and71": 1597, "45and52and61and71": 1598, "47and59and64and66": 1599, "47and54and64and66": 1600, "47and59and61and64": 1601, "47and58and61and64": 1602, "47and54and64": 1603, "47and54and63": 1604, "49and52and63and64": 1605, "49and57and61and64": 1606, "52and57and61and64": 1607, "45and54and61and68": 1608, "44and54and59and71": 1609, "44and54and61and66": 1610, "44and52and63and71": 1611, "44and52and64and71": 1612, "42and51and66and71": 1613, "44and53and61and71": 1614, "45and54and66and69": 1615, "47and54and66and69": 1616, "44and51and66and68": 1617, "49and52and64and68": 1618, "49and54and64and68": 1619, "49and56and63and68": 1620, "49and51and63and68": 1621, "47and56and63and68": 1622, "45and56and63and72": 1623, "45and54and66and75": 1624, "44and54and68and72": 1625, "44and52and68and73": 1626, "44and51and66and73": 1627, "44and51and66and72": 1628, "49and61and64and73": 1629, "50and61and66": 1630, "50and59and69": 1631, "51and59and69": 1632, "52and59and68and71": 1633, "52and57and66and71": 1634, "52and56and61and73": 1635, "54and57and68and75": 1636, "52and57and66and73": 1637, "52and58and66and73": 1638, "49and59and64and73": 1639, "49and52and57and68": 1640, "52and57and66": 1641, "52and58and66": 1642, "49and54and59and64": 1643, "47and56and59and63": 1644, "44and59and63and65": 1645, "49and57and61and65": 1646, "49and57and61and66": 1647, "45and54and61and73": 1648, "44and54and68and71": 1649, "44and53and68and71": 1650, "42and54and61and71": 1651, "42and54and61and69": 1652, "47and50and59and69": 1653, "47and50and59and68": 1654, "49and57and68": 1655, "49and57and66": 1656, "37and49and56and66": 1657, "37and49and56and65": 1658, "42and49and57and66": 1659, "44and49and59and66": 1660, "45and49and61and66": 1661, "42and51and61and66": 1662, "49and53and61and68": 1663, "49and61and69": 1664, "49and56and65and71": 1665, "50and54and66and71": 1666, "49and54and66and69": 1667, "48and56and66and68": 1668, "49and64and68": 1669, "42and49and63and66": 1670, "44and48and63and66": 1671, "45and51and61and66": 1672, "44and51and60and69": 1673, "46and51and61and68": 1674, "48and51and63and66": 1675, "49and52and56and64": 1676, "49and54and56and64": 1677, "49and56and63": 1678, "45and56and61": 1679, "45and54and69": 1680, "44and52and60": 1681, "44and52and61": 1682, "44and51and61and68": 1683, "44and52and61and69": 1684, "44and52and61and73": 1685, "42and63and71": 1686, "42and63and69": 1687, "40and64and68": 1688, "37and68": 1689, "42and66and70": 1690, "42and64and70": 1691, "47and69and71": 1692, "64and68and71": 1693, "54and63and66and71": 1694, "54and61and64and70": 1695, "56and59and63and71": 1696, "59and62and64and68": 1697, "54and57and69and75": 1698, "52and59and69and76": 1699, "52and59and68and76": 1700, "59and64and76": 1701, "47and59and66and76": 1702, "49and56and64and76": 1703, "52and56and64and71": 1704, "51and56and64and71": 1705, "51and54and66and71": 1706, "47and51and66and71": 1707, "51and54and69and78": 1708, "52and61and66and69": 1709, "49and52and69and73": 1710, "51and54and69and71": 1711, "53and56and68and71": 1712, "54and57and66and69": 1713, "54and61and68and73": 1714, "53and61and68and71": 1715, "54and61and66and69": 1716, "51and61and67and76": 1717, "53and59and68and75": 1718, "56and63and66and71": 1719, "56and61and64and70": 1720, "55and61and64and70": 1721, "56and59and63and70": 1722, "51and58and63and68": 1723, "51and59and63and68": 1724, "39and61and63and68": 1725, "39and61and63and67": 1726, "52and61and64": 1727, "52and64and66": 1728, "54and63and71": 1729, "57and61and75": 1730, "47and54and71and76": 1731, "49and52and68and75": 1732, "49and71and76": 1733, "49and52and69and76": 1734, "47and51and69and78": 1735, "47and59and63and78": 1736, "61and64and81": 1737, "63and66and81": 1738, "64and69and78": 1739, "63and71and78": 1740, "61and69and76": 1741, "47and54and64and71": 1742, "47and54and63and71": 1743, "49and52and68": 1744, "52and54and70": 1745, "49and56and71and76": 1746, "49and57and69and76": 1747, "47and51and68and75": 1748, "45and52and68and73": 1749, "45and54and66and73": 1750, "44and56and64and71": 1751, "42and57and64and69": 1752, "42and57and63and69": 1753, "42and69": 1754, "44and71": 1755, "45and61and64and69": 1756, "48and71": 1757, "57and75": 1758, "44and75": 1759, "39and75": 1760, "46and63and65and68": 1761, "46and58and63and67": 1762, "50and80": 1763, "49and75": 1764, "41and77": 1765, "36and77": 1766, "44and77": 1767, "51and62": 1768, "55and59": 1769, "43and59": 1770, "53and59": 1771, "55and70and72": 1772, "56and62and72": 1773, "55and67and72and75": 1774, "43and67and71and74": 1775, "36and63and67and72": 1776, "55and63and67and72": 1777, "49and56and73": 1778, "59and65and73": 1779, "54and68and73": 1780, "49and56": 1781, "51and68and72": 1782, "44and56": 1783, "42and51": 1784, "53and65and75": 1785, "58and66and75": 1786, "58and61and77": 1787, "53and56and66": 1788, "53and61": 1789, "49and56and61": 1790, "58and63and68": 1791, "51and59and65": 1792, "42and54and61": 1793, "54and61and65": 1794, "54and61and63": 1795, "48and56and66": 1796, "37and49": 1797, "37and49and56": 1798, "56and61and68": 1799, "56and62and68": 1800, "51and58and61": 1801, "58and64and68": 1802, "56and66and73": 1803, "44and66and72": 1804, "61and64and76": 1805, "51and73and78": 1806, "51and72and78": 1807, "49and73and78": 1808, "49and69and73": 1809, "51and61and73": 1810, "51and63and75": 1811, "54and66and71": 1812, "57and68and71": 1813, "56and66and69": 1814, "51and66and69": 1815, "52and66and69": 1816, "49and66and71": 1817, "41and63and73": 1818, "46and63and71": 1819, "49and70and73": 1820, "39and70and76": 1821, "39and73and75": 1822, "54and71and75": 1823, "52and71and76": 1824, "51and72and76": 1825, "49and73and77": 1826, "51and73and80": 1827, "51and73and79": 1828, "51and70and80": 1829, "54and73and81": 1830, "54and71and77": 1831, "53and71and80": 1832, "54and71and81": 1833, "49and71and77": 1834, "57and71and78": 1835, "45and69and78": 1836, "57and68and76": 1837, "56and64and69": 1838, "59and64and68": 1839, "59and64": 1840, "54and76": 1841, "49and76": 1842, "66and69and76": 1843, "64and73and82": 1844, "59and71and80": 1845, "49and74and77": 1846, "49and71and78": 1847, "42and69and78": 1848, "50and71and78": 1849, "44and71and78": 1850, "54and68and76": 1851, "51and68and73": 1852, "63and64": 1853, "54and72and78": 1854, "54and71and73": 1855, "51and69and78": 1856, "52and76and80": 1857, "52and70and80": 1858, "45and66and76": 1859, "56and66and71": 1860, "54and64and68": 1861, "54and61and64": 1862, "63and80": 1863, "44and75and78": 1864, "61and76and80": 1865, "59and63and75": 1866, "54and68and69": 1867, "44and66and75": 1868, "44and68and76": 1869, "56and69and77": 1870, "44and73and76": 1871, "44and56and64and73": 1872, "73and76and79and82": 1873, "38and67": 1874, "38and65": 1875, "46and77": 1876, "62and80": 1877, "59and80": 1878, "66and75": 1879, "50and78": 1880, "46and79": 1881, "43and69": 1882, "41and64": 1883, "45and61": 1884, "45and60": 1885, "54and55": 1886, "39and51and58": 1887, "39and48and60": 1888, "39and46and50and68": 1889, "46and53and68": 1890, "56and62and68and71": 1891, "48and66": 1892, "43and65": 1893, "46and65and70and75": 1894, "46and65and70and74": 1895, "65and70and74": 1896, "75and76": 1897, "71and75": 1898, "66and73": 1899, "78and82": 1900, "74and83": 1901, "69and81": 1902, "66and78": 1903, "74and78and86": 1904, "81and84": 1905, "54and57and62": 1906, "78and81": 1907, "43and60": 1908, "38and45": 1909, "27": 1910, "41and50and56": 1911, "38and50and54": 1912, "38and46and55and62": 1913, "46and55and62": 1914, "64and71and74": 1915, "48and67and71": 1916, "57and65and69": 1917, "53and67and71": 1918, "57and62and72": 1919, "50and60and72": 1920, "53and60and77": 1921, "53and81": 1922, "53and72and81": 1923, "55and71and81": 1924, "53and72and79": 1925, "50and74and78": 1926, "49and74and78": 1927, "52and74and79": 1928, "54and72and81": 1929, "55and72and81": 1930, "54and72and74": 1931, "55and71and83": 1932, "55and74and81": 1933, "57and74and81": 1934, "53and69and81": 1935, "55and69and81": 1936, "50and76and80": 1937, "52and76and83": 1938, "54and76and81": 1939, "54and74and76": 1940, "56and74and76": 1941, "57and72and84": 1942, "59and74and84": 1943, "55and81and84": 1944, "57and81and84": 1945, "55and74and84": 1946, "55and74and79": 1947, "60and74and76": 1948, "59and74and76": 1949, "59and71and79": 1950, "60and71and79": 1951, "62and71and79": 1952, "62and67and76": 1953, "65and71and76": 1954, "67and69and73": 1955, "64and65and81": 1956, "64and67and79": 1957, "64and69and77": 1958, "64and67and74": 1959, "62and65and74": 1960, "57and67and73": 1961, "64and77": 1962, "66and81": 1963, "62and65and67": 1964, "47and60and65": 1965, "43and59and64": 1966, "48and55and57": 1967, "47and55and57": 1968, "50and54and57": 1969, "47and55and59": 1970, "48and55and59": 1971, "45and55and60": 1972, "47and53and60": 1973, "48and53and57": 1974, "50and53and57": 1975, "47and53and62": 1976, "52and55and62": 1977, "53and55and62": 1978, "52and55and59": 1979, "53and57and64": 1980, "55and57and64": 1981, "53and57and65": 1982, "52and62and65": 1983, "53and62and65": 1984, "57and59and65": 1985, "52and62and71": 1986, "50and64and72": 1987, "46and67and72": 1988, "43and60and72": 1989, "43and67and72": 1990, "40and67and72": 1991, "47and65and72": 1992, "53and64and72": 1993, "55and59and76": 1994, "55and62and74": 1995, "55and59and74": 1996, "57and67and71": 1997, "62and67and74": 1998, "43and67and71": 1999, "42and67and71": 2000, "47and76": 2001, "48and67and74": 2002, "50and67and74": 2003, "47and62and74": 2004, "48and62and74": 2005, "44and69and72": 2006, "45and69and76": 2007, "47and69and74": 2008, "47and67and69": 2009, "50and69and76": 2010, "47and71and74": 2011, "45and71and74": 2012, "48and71and76": 2013, "52and69and77": 2014, "50and67and79": 2015, "52and71and79": 2016, "52and71and77": 2017, "53and71and77": 2018, "50and67and77": 2019, "47and72and76": 2020, "50and70and79": 2021, "47and69and77": 2022, "45and69and77": 2023, "43and67and77": 2024, "45and65and76": 2025, "48and65and76": 2026, "47and65and76": 2027, "57and65and71": 2028, "53and65and67": 2029, "59and64and72": 2030, "52and62and72": 2031, "53and64and71": 2032, "52and69and72": 2033, "53and67and74": 2034, "56and62and71": 2035, "45and60and72": 2036, "45and60and65": 2037, "48and60and62": 2038, "57and60and64": 2039, "57and60and67": 2040, "55and60and67": 2041, "53and60and64": 2042, "53and59and64": 2043, "48and50and60": 2044, "55and57and60": 2045, "47and50and60": 2046, "45and50and60": 2047, "43and55and60": 2048, "41and55and60": 2049, "45and55and59": 2050, "43and57and60": 2051, "41and57and60": 2052, "36and58and67": 2053, "38and65and69": 2054, "40and65and69": 2055, "36and65": 2056, "45and60and67": 2057, "41and62and65": 2058, "38and55and65": 2059, "50and59and65and68": 2060, "52and60and64and67": 2061, "48and60and64and67": 2062, "48and62and68and71": 2063, "48and64and67and72": 2064, "56and59and62and65": 2065, "48and59and62and65": 2066, "47and64and72": 2067, "74and82": 2068, "52and77and82": 2069, "60and77and79": 2070, "60and76and79": 2071, "57and72and79": 2072, "55and72and84": 2073, "60and69and77": 2074, "48and65and74": 2075, "47and65and67": 2076, "45and65and67": 2077, "60and65and67": 2078, "53and60and72": 2079, "50and60and70": 2080, "57and65and67": 2081, "53and62and67": 2082, "43and62and71": 2083, "50and60and77": 2084, "48and60and76": 2085, "52and57and73": 2086, "52and58and73": 2087, "52and55and73": 2088, "50and53and81": 2089, "46and55and76": 2090, "46and55and77": 2091, "45and55and71": 2092, "45and53and74": 2093, "45and50and74": 2094, "45and56and71": 2095, "46and57and72": 2096, "48and57and72": 2097, "55and57and70": 2098, "51and60and69": 2099, "51and60and70": 2100, "50and60and62": 2101, "50and61and64": 2102, "55and60and70": 2103, "53and64and69": 2104, "58and69and74": 2105, "62and67and77": 2106, "62and65and77": 2107, "59and67and76": 2108, "60and71and76": 2109, "64and72and79": 2110, "59and67and79": 2111, "57and72and78": 2112, "51and72and79": 2113, "50and74and79": 2114, "48and75and79": 2115, "50and69and78": 2116, "54and69and81": 2117, "48and66and69": 2118, "46and66and67": 2119, "43and66and75": 2120, "47and73": 2121, "46and69and74": 2122, "43and69and76": 2123, "41and74": 2124, "40and76": 2125, "38and77": 2126, "52and60and76": 2127, "51and57and72": 2128, "51and55and72": 2129, "50and62and72": 2130, "52and62and70": 2131, "48and60and69": 2132, "46and58and62": 2133, "53and58and60": 2134, "51and57and63": 2135, "45and62and69": 2136, "43and62and70": 2137, "43and63and70": 2138, "39and67and70": 2139, "39and67and72": 2140, "36and67and75": 2141, "36and69and75": 2142, "36and70and75": 2143, "36and72and75": 2144, "38and72and75": 2145, "39and70and75": 2146, "41and69and74": 2147, "41and69and77": 2148, "41and69and70": 2149, "41and67and69": 2150, "41and64and69": 2151, "41and65and67": 2152, "41and63and67": 2153, "45and62and65": 2154, "53and60and67": 2155, "53and67and70": 2156, "50and58and68": 2157, "53and56and67": 2158, "53and56and64": 2159, "48and59and64": 2160, "48and58and68": 2161, "48and58and65": 2162, "48and56and67": 2163, "48and56and64": 2164, "48and55and70": 2165, "48and55and76": 2166, "48and58and79": 2167, "48and60and80": 2168, "48and60and73": 2169, "48and58and73": 2170, "48and56and82": 2171, "48and53and73": 2172, "48and52and72": 2173, "50and52and72": 2174, "43and77": 2175, "43and47and80": 2176, "43and47and79": 2177, "36and48and77": 2178, "36and48and76": 2179, "50and73": 2180, "56and60and64": 2181, "48and55and60and65": 2182, "48and55and60and62": 2183, "48and53and60and63and69": 2184, "48and53and60and63and67": 2185, "46and58and61and65and70and73": 2186, "49and58and61and65and70and73": 2187, "60and69and72": 2188, "41and62and70": 2189, "45and64and72": 2190, "43and64and72": 2191, "45and69and74": 2192, "46and64and72": 2193, "45and65and72": 2194, "48and72and74": 2195, "45and65and74": 2196, "45and70and74": 2197, "46and70and79": 2198, "46and67and76": 2199, "45and72and76": 2200, "46and72and76": 2201, "48and69and77": 2202, "63and74": 2203, "65and79": 2204, "65and84": 2205, "67and82": 2206, "68and73": 2207, "67and80": 2208, "60and65and70": 2209, "60and64and70": 2210, "53and72and73": 2211, "52and67and68": 2212, "56and62and67": 2213, "58and64and67": 2214, "56and64and67": 2215, "61and64and72": 2216, "65and68and72": 2217, "56and68and80": 2218, "46and68and72": 2219, "51and67and79": 2220, "55and67and79": 2221, "44and67and70": 2222, "43and63and65": 2223, "43and72": 2224, "41and73": 2225, "60and73": 2226, "61and63and75": 2227, "55and68and75": 2228, "53and62and80": 2229, "53and62and79": 2230, "58and62and80": 2231, "51and72and74": 2232, "50and70and74": 2233, "47and67and72": 2234, "43and67and75": 2235, "43and67and74": 2236, "39and67and74": 2237, "39and65and74": 2238, "39and68and77": 2239, "38and68and71": 2240, "38and68and72": 2241, "47and67and74": 2242, "47and65and74": 2243, "43and62and74": 2244, "43and65and72": 2245, "43and65and71": 2246, "36and65and72": 2247, "36and64and72": 2248, "36and62and72": 2249, "60and67and70": 2250, "53and64and68": 2251, "56and76and79": 2252, "58and73and79": 2253, "56and73and79": 2254, "61and67and79": 2255, "61and75": 2256, "63and78": 2257, "65and78and81": 2258, "63and78and81": 2259, "61and78and82": 2260, "60and78and82": 2261, "67and73and82": 2262, "68and72and82": 2263, "70and72and82": 2264, "63and77": 2265, "56and73and77": 2266, "53and72and77": 2267, "48and56and74": 2268, "48and58and70": 2269, "48and53and65": 2270, "48and52and76": 2271, "56and74": 2272, "56and79": 2273, "49and56and77": 2274, "49and56and78": 2275, "49and57and75": 2276, "49and58and72": 2277, "49and60and69": 2278, "42and70and73": 2279, "41and68and73": 2280, "39and65and73": 2281, "45and66and73": 2282, "45and61and72": 2283, "51and61and72": 2284, "58and60and72": 2285, "58and60and73": 2286, "60and65and74": 2287, "56and67and76": 2288, "55and68and77": 2289, "56and68and77": 2290, "55and70and76": 2291, "48and76and79": 2292, "48and72and79": 2293, "52and76and79": 2294, "52and73and79": 2295, "58and70and77": 2296, "65and73and76": 2297, "65and68and79": 2298, "65and67and79": 2299, "64and65and80": 2300, "67and72and80": 2301, "65and72and80": 2302, "63and72and80": 2303, "65and73and80": 2304, "58and73and80": 2305, "58and72and80": 2306, "63and72and79": 2307, "56and70and79": 2308, "53and73and77": 2309, "58and73and75": 2310, "49and53and70": 2311, "49and55and70": 2312, "49and57and70": 2313, "43and73": 2314, "41and70": 2315, "41and65and73": 2316, "38and68": 2317, "36and64and70": 2318, "40and68": 2319, "48and72and76": 2320, "61and68and70": 2321, "61and68and72": 2322, "55and68and70": 2323, "55and68and72": 2324, "40and67and70": 2325, "43and67and70": 2326, "60and67and68": 2327, "56and67and72": 2328, "56and67and70": 2329, "36and65and68": 2330, "53and65and77": 2331, "58and65and67": 2332, "46and65and68": 2333, "46and65and67": 2334, "36and64and65": 2335, "55and59and63": 2336, "48and60and67": 2337, "56and84": 2338, "56and82": 2339, "47and63": 2340, "50and59": 2341, "47and72": 2342, "48and74and75": 2343, "48and71and75": 2344, "44and72and77": 2345, "39and71and79": 2346, "39and72": 2347, "46and67and73": 2348, "44and64and72": 2349, "43and64and70": 2350, "50and60and63": 2351, "47and62and65": 2352, "39and55and65": 2353, "39and60and63": 2354, "36and60and63": 2355, "44and65and72": 2356, "46and66and72": 2357, "46and66and70": 2358, "46and61and67": 2359, "44and61and68": 2360, "44and60and64": 2361, "56and67and73": 2362, "60and68and73": 2363, "46and63and70": 2364, "51and62and67": 2365, "55and60and79": 2366, "53and65and80": 2367, "62and65and71": 2368, "55and63and71": 2369, "55and63and79": 2370, "57and62and77": 2371, 